# Pandas

Pandas is a powerful library for data manipulation and analysis in Python. It is widely used in a range of fields, including data science, finance, and statistics.

## 001. DataFrame Importing / Exporting

## 001.000 Assets

Some assets to avoid too much typing

| Name        | Age|
|-------------|----|
| Mbappé      | 23 |
| De Bruyne   | 31 |
| Lewandowski | 33 |
| Benzema     | 34 |
| Messi       | 35 |

In [1]:
import sys
from pathlib import Path

current_dir = Path().resolve()
while current_dir != current_dir.parent and current_dir.name != "katas":
    current_dir = current_dir.parent
if current_dir != current_dir.parent:
    sys.path.append(current_dir.as_posix())

In [2]:
import pandas as pd
import numpy as np
from lib.utils import fresh_df
from IPython.core.interactiveshell import InteractiveShell

pd.set_option('display.max_rows', None)
InteractiveShell.ast_node_interactivity = "all"
names_as_list = ["Mbappé", "De Bruyne", "Lewandowski", "Benzema", "Messi"]
ages_as_list = [ 23,       31,          33,             34,        35]

### 001.001 Dictionary of arrays

1. Replicate this data as a dataframe with a dictionary of arrays, using a constructor, and print it
1. Do the same, but using from_dict
1. Extract the dict out of the df again with to_dict

In [17]:
# solution

1
data = {
    "Name": names_as_list,
    "Age": ages_as_list
}
df = pd.DataFrame(data)
df

2
pd.DataFrame.from_dict(data)

3
df.to_dict(orient="list")

1

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

2

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

3

{'Name': ['Mbappé', 'De Bruyne', 'Lewandowski', 'Benzema', 'Messi'],
 'Age': [23, 31, 33, 34, 35]}

### 001.002 List of dictionaries

1. Create a list where every entry is a dict with keys "Name" and "Age", and print
1. Create a df from it
1. Do the same, but using from_records
1. Extract the list out of the df again with to_dict (not to_records). Note that you can actually get a list and not a dict, with the right parameters...

In [25]:
# solution

1
data = [{"Name": name, "Age": age} for name, age in zip(names_as_list, ages_as_list)]
data

2
df = pd.DataFrame(data)
df

3
df = pd.DataFrame.from_records(data)
df

4
df.to_dict(orient="records")

1

[{'Name': 'Mbappé', 'Age': 23},
 {'Name': 'De Bruyne', 'Age': 31},
 {'Name': 'Lewandowski', 'Age': 33},
 {'Name': 'Benzema', 'Age': 34},
 {'Name': 'Messi', 'Age': 35}]

2

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

3

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

4

[{'Name': 'Mbappé', 'Age': 23},
 {'Name': 'De Bruyne', 'Age': 31},
 {'Name': 'Lewandowski', 'Age': 33},
 {'Name': 'Benzema', 'Age': 34},
 {'Name': 'Messi', 'Age': 35}]

### 001.003 2D NumPy array

1. Print a NumPy 2D array with the same data as before, but with an extra column for "Last Updated" with a pd.Timestamp, and create a df with it. Make sure the column names are still "Name", "Age", "Last Updated"
1. Update the "Last Updated" column with the current timestamp
1. Convert to a NumPy and print it, proving the timestamp is different

In [30]:
# solution
1
data = np.array([[name, age, pd.Timestamp.now()] for name, age in zip(names_as_list, ages_as_list)])

df = pd.DataFrame(data, columns=["Name", "Age", "Last Updated"])
df

2
df["Last Updated"] = pd.Timestamp.now()
df

3
df.to_numpy()

1

          Name Age               Last Updated
0       Mbappé  23 2023-01-26 20:48:07.933563
1    De Bruyne  31 2023-01-26 20:48:07.933580
2  Lewandowski  33 2023-01-26 20:48:07.933583
3      Benzema  34 2023-01-26 20:48:07.933585
4        Messi  35 2023-01-26 20:48:07.933587

2

          Name Age               Last Updated
0       Mbappé  23 2023-01-26 20:48:07.938145
1    De Bruyne  31 2023-01-26 20:48:07.938145
2  Lewandowski  33 2023-01-26 20:48:07.938145
3      Benzema  34 2023-01-26 20:48:07.938145
4        Messi  35 2023-01-26 20:48:07.938145

3

array([['Mbappé', 23, Timestamp('2023-01-26 20:48:07.938145')],
       ['De Bruyne', 31, Timestamp('2023-01-26 20:48:07.938145')],
       ['Lewandowski', 33, Timestamp('2023-01-26 20:48:07.938145')],
       ['Benzema', 34, Timestamp('2023-01-26 20:48:07.938145')],
       ['Messi', 35, Timestamp('2023-01-26 20:48:07.938145')]],
      dtype=object)

### 001.004 Pandas Series

1. Create two pandas series from the two lists, and then concatenate them into a df. Make sure the colum names are still "Name" and "Age"

In [34]:
# solution
s1 = pd.Series(names_as_list)
s2 = pd.Series(ages_as_list)

pd.concat([s1, s2], names=["Name", "Age"], axis=1)

             0   1
0       Mbappé  23
1    De Bruyne  31
2  Lewandowski  33
3      Benzema  34
4        Messi  35

### 001.005 SQL (sqlite)

1. Create a DataFrame by reading from table 'players' in SQLite DB "001.005.sqlite" with the built-in SQLite module. Note that the index column is called 'id'
1. Change the Last Updated column to the current timestamp in the DataFrame. Write the updated DataFrame data to the database. HINT: Make sure you tell the function to use the 'id' column for indices
1. Load the data again in a new DataFrame, and confirm it's same as for step (1) except for the timestamp

In [38]:
# solution
import sqlite3 as sqlite

1
con = sqlite.connect("001.005.sqlite")
df = pd.read_sql("SELECT * FROM players", index_col="id", con=con)
df

2
df["Last Updated"] = pd.Timestamp.now()
df.to_sql("players", if_exists="replace", con=con, index=True, index_label="id")

3
pd.read_sql("SELECT * FROM players", index_col="id", con=con)

1

           Name  Age                Last Updated
id
0        Mbappé   23  2023-01-26 20:34:25.131545
1     De Bruyne   31  2023-01-26 20:34:25.131545
2   Lewandowski   33  2023-01-26 20:34:25.131545
3       Benzema   34  2023-01-26 20:34:25.131545
4         Messi   35  2023-01-26 20:34:25.131545

2

5

3

           Name  Age                Last Updated
id
0        Mbappé   23  2023-01-26 20:53:35.513056
1     De Bruyne   31  2023-01-26 20:53:35.513056
2   Lewandowski   33  2023-01-26 20:53:35.513056
3       Benzema   34  2023-01-26 20:53:35.513056
4         Messi   35  2023-01-26 20:53:35.513056

### 001.006 SQL (sqlalchemy)

1. Replicate 001.005 but use sqlalchemy to connect to the DB

(Note: you will probably get warnings, but you can ignore them)

In [42]:
# solution
from sqlalchemy import create_engine

engine = create_engine("sqlite:///001.005.sqlite")
con = engine.raw_connection()
df = pd.read_sql("SELECT * FROM players", con=con, index_col="id")
df

df["Last Updated"] = pd.Timestamp.now()
df.to_sql("players", if_exists="replace", con=con, index=True, index_label="id")


pd.read_sql("SELECT * FROM players", con=con, index_col="id")

/var/folders/xx/dkxnk6_906gd2s414jw_d4m80000gn/T/ipykernel_73437/159933682.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM players", con=con, index_col="id")

           Name  Age                Last Updated
id
0        Mbappé   23  2023-01-26 20:53:35.513056
1     De Bruyne   31  2023-01-26 20:53:35.513056
2   Lewandowski   33  2023-01-26 20:53:35.513056
3       Benzema   34  2023-01-26 20:53:35.513056
4         Messi   35  2023-01-26 20:53:35.513056

/var/folders/xx/dkxnk6_906gd2s414jw_d4m80000gn/T/ipykernel_73437/159933682.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df.to_sql("players", if_exists="replace", con=con, index=True, index_label="id")

5

/var/folders/xx/dkxnk6_906gd2s414jw_d4m80000gn/T/ipykernel_73437/159933682.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SELECT * FROM players", con=con, index_col="id")

           Name  Age                Last Updated
id
0        Mbappé   23  2023-01-26 20:56:37.569231
1     De Bruyne   31  2023-01-26 20:56:37.569231
2   Lewandowski   33  2023-01-26 20:56:37.569231
3       Benzema   34  2023-01-26 20:56:37.569231
4         Messi   35  2023-01-26 20:56:37.569231

### 001.007 TSV file

1. Create a DataFrame by reading from TSV file in `data_file`. Note that the index column is called 'id'
1. Change the Last Updated column to the current timestamp in the DataFrame. Write the updated DataFrame data to the same file. HINT: Make sure you tell the function to use the 'id' column for indices
1. Load the data again in a new DataFrame, and confirm it's same as for step (1) except for the timestamp

In [43]:
data_file = "001.007.tsv"
# solution

df = pd.read_csv(data_file, sep="\t", index_col="id")
df

df["Last Updated"] = pd.Timestamp.now()
df.to_csv(data_file, sep="\t", index=True, index_label="id")

pd.read_csv(data_file, sep="\t", index_col="id")

           Name  Age                Last Updated
id
0        Mbappé   23  2023-01-26 20:34:25.161435
1     De Bruyne   31  2023-01-26 20:34:25.161435
2   Lewandowski   33  2023-01-26 20:34:25.161435
3       Benzema   34  2023-01-26 20:34:25.161435
4         Messi   35  2023-01-26 20:34:25.161435

           Name  Age                Last Updated
id
0        Mbappé   23  2023-01-26 20:57:49.290302
1     De Bruyne   31  2023-01-26 20:57:49.290302
2   Lewandowski   33  2023-01-26 20:57:49.290302
3       Benzema   34  2023-01-26 20:57:49.290302
4         Messi   35  2023-01-26 20:57:49.290302

### 001.008 JSON file

1. Create a DataFrame by reading from JSON file in `data_file`
1. Change the Last Updated column to the current timestamp in the DataFrame. Write the updated DataFrame data to the same file. HINT: Make sure you tell the function to use the 'id' column for indices
1. Load the data again in a new DataFrame, and confirm it's same as for step (1) except for the timestamp. Make sure non ASCII characters are readable

In [44]:
data_file = "001.008.json"
# solution

df = pd.read_json(data_file)
df

df["Last Updated"] = pd.Timestamp.now()
df.to_json(data_file, force_ascii=False)

pd.read_json(data_file)

          Name  Age   Last Updated
0       Mbappé   23  1674765265198
1    De Bruyne   31  1674765265198
2  Lewandowski   33  1674765265198
3      Benzema   34  1674765265198
4        Messi   35  1674765265198

          Name  Age   Last Updated
0       Mbappé   23  1674766762347
1    De Bruyne   31  1674766762347
2  Lewandowski   33  1674766762347
3      Benzema   34  1674766762347
4        Messi   35  1674766762347

### 001.009 From a table in an HTML page

1. Create a DataFrame by reading from HTML file in `data_file`. Use beautifulsoup flavor. Note that the column ID is called "ID"
1. Change the Last Updated column to the current timestamp in the DataFrame. Write the updated DataFrame data to the same file. HINT: Make sure you "flatten" the indices, because `to_html` writes two rows for the headers exactly as you see in the output
1. Load the data again in a new DataFrame, and confirm it's same as for step (1) except for the timestamp

In [51]:
data_file = "001.009.html"
# solution

df = pd.read_html(data_file, flavor="bs4", index_col="ID")[0]
df

df["Last Updated"] = pd.Timestamp.now()
df.columns.name = "ID"
df.index.name = None
df.to_html(data_file, index=True, header=["ID", "Name", "Age", "Last Updated"])

pd.read_html(data_file, flavor="bs4", index_col="ID")[0]

           Name  Age                Last Updated
ID
0        Mbappé   23  2023-01-26 21:01:40.980392
1     De Bruyne   31  2023-01-26 21:01:40.980392
2   Lewandowski   33  2023-01-26 21:01:40.980392
3       Benzema   34  2023-01-26 21:01:40.980392
4         Messi   35  2023-01-26 21:01:40.980392

           Name  Age                Last Updated
ID
0        Mbappé   23  2023-01-26 21:01:43.204090
1     De Bruyne   31  2023-01-26 21:01:43.204090
2   Lewandowski   33  2023-01-26 21:01:43.204090
3       Benzema   34  2023-01-26 21:01:43.204090
4         Messi   35  2023-01-26 21:01:43.204090